OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
/**************************************************************************/
/*                                                                        */
/*       Copyright (c) Microsoft Corporation. All rights reserved.        */
/*                                                                        */
/*       This software is licensed under the Microsoft Software License   */
/*       Terms for Microsoft Azure RTOS. Full text of the license can be  */
/*       found in the LICENSE file at https://aka.ms/AzureRTOS_EULA       */
/*       and in the root directory of this software.                      */
/*                                                                        */
/**************************************************************************/


/**************************************************************************/
/**************************************************************************/
/**                                                                       */
/** NetX Component                                                        */
/**                                                                       */
/**   NetX Porting layer for ESP8266 WiFi                           */
/**                                                                       */
/**************************************************************************/
/**************************************************************************/

#include "tx_api.h"
#include "nx_api.h"
/* ESP8266 */
#include "esp8266_wifi.h"
#include "nx_ip.h"
#include "nx_tcp.h"
#include "tx_thread.h"
#include "nx_wifi.h"

#define WIFI_WRITE_TIMEOUT          100
#define WIFI_READ_TIMEOUT           100

#ifndef WIFI_THREAD_PERIOD
#define WIFI_THREAD_PERIOD          100
#endif /* WIFI_THREAD_PERIOD  */

/* Define the default thread priority, stack size, etc. The user can override this 
   via -D command line option or via project settings.  */

/* ESP8266: Enlarge from 1024 to 2048 */
#ifndef NX_WIFI_STACK_SIZE
#define NX_WIFI_STACK_SIZE          (2048)
#endif /* NX_WIFI_STACK_SIZE  */

#ifndef NX_WIFI_THREAD_PRIORITY
#define NX_WIFI_THREAD_PRIORITY     (1)
#endif /* NX_WIFI_THREAD_PRIORITY  */

/* Define the stack for X-WARE WIFI.  */
static UCHAR                        nx_wifi_thread_stack[NX_WIFI_STACK_SIZE];

/* Define the prototypes for X-WARE.  */
static TX_THREAD                    nx_wifi_thread;
static NX_PACKET_POOL               *nx_wifi_pool;
static NX_IP                        *nx_wifi_ip;

/* Define the socket type, TCP socket or UDP socket.  */
#define NX_WIFI_TCP_SOCKET          0
#define NX_WIFI_UDP_SOCKET          1

/* ESP8266: Reserve some packets for applications, such as HTTP, etc.
 * 
 * Enlarge to avoid missing ESP active receive packets.
 */
#ifndef NX_WIFI_PACKET_RESERVED
#define NX_WIFI_PACKET_RESERVED     5
#endif /* NX_WIFI_PACKET_RESERVED  */

/* Define the WIFI socket structure.  */
typedef struct NX_WIFI_SOCKET_STRUCT
{

    /* Define socket pointer.  */
    VOID       *nx_wifi_socket_ptr;
    
    /* Define socket flag.  */
    CHAR        nx_wifi_socket_valid;
    
    /* Define socket type.  TCP or UDP.  */
    CHAR        nx_wifi_socket_type;
    
    /* Define the connected flag.  */
    CHAR        nx_wifi_socket_connected;

    /* ESP8266: socket receive notify count */
#if 0
    /* Reserved.  */
    CHAR        reserved;
#else
    CHAR        nx_wifi_socket_receive_notify;
#endif
    
    /* Define the deferred packet processing queue.  */
    NX_PACKET   *nx_wifi_received_packet_head,
                *nx_wifi_received_packet_tail;

}NX_WIFI_SOCKET;

/* ESP8266: Change from 8 to 5 */
#ifndef NX_WIFI_SOCKET_COUNTER
#define NX_WIFI_SOCKET_COUNTER          ESP_CFG_SOCKET_COUNT
#endif /* NX_WIFI_SOCKET_COUNTER  */

/* Define the TCP socket and UDP socket.  */
static NX_WIFI_SOCKET               nx_wifi_socket[NX_WIFI_SOCKET_COUNTER];

/* Define the SOCKET ID.  */
static CHAR                         nx_wifi_socket_counter;

/* ESP8266: Define the buffer to receive data from wifi.  */
static CHAR                         nx_wifi_buffer[ESP_CFG_IPDBUF_SIZE];

/* Define the wifi thread.  */
static void    nx_wifi_thread_entry(ULONG thread_input);

/* ESP8266: Data receive callback */
static void nxesp_datarecv_handler(void *Ctx, uint8_t LinkID, uint8_t *Data, uint16_t Size);

/* ESP8266: Notify socket receive */
static void nx_notify_socket_receive(uint8_t entry_index);

/* ESP8266: UDP client connect */
static UINT nx_wifi_udp_client_socket_connect(NX_UDP_SOCKET *socket_ptr,
                                              UCHAR entry_index,
                                              NXD_ADDRESS *server_ip,
                                              UINT server_port);
                                        
/* ESP8266: Data receive callback context */
typedef struct {
    uint8_t dummy;      // Avoid null struct
} NXESP_DATARECV_CTX;

NXESP_DATARECV_CTX nxesp_datarecv_ctx;

/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_initialize                                  PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function initializes the NetX Wifi.                            */ 
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    ip_ptr                                Pointer to IP control block   */
/*    packet_pool                           Packet pool pointer           */ 
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
UINT nx_wifi_initialize(NX_IP *ip_ptr, NX_PACKET_POOL *packet_pool)
{
  
