OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
UINT    status;
        
    /* ESP8266 */
    {
        ESP_WIFI_Status_t esp_status;

        /* Should have connected to AP */
        if (!ESP_WIFI_IsConnected()) {
            ESP_LOG_CRIT("ESP WiFi not connected to AP\r\n");
            status = NX_NOT_SUCCESSFUL;
            return NX_NOT_SUCCESSFUL;
        }

        /* Reset data receive callback context */
        memset(&nxesp_datarecv_ctx, 0x00, sizeof(nxesp_datarecv_ctx));

        /* Install data receive callback */
        esp_status = ESP_WIFI_InstallDataRecvCallback(nxesp_datarecv_handler, &nxesp_datarecv_ctx);
        if (esp_status != ESP_WIFI_STATUS_OK) {
            ESP_LOG_CRIT("Fail to install data receive callback (%d)\r\n", esp_status);
            status = NX_NOT_SUCCESSFUL;
            return NX_NOT_SUCCESSFUL;
        }
    }

    /* Set the IP.  */
    nx_wifi_ip = ip_ptr;
    
    /* Set the pool.  */
    nx_wifi_pool = packet_pool;
    
    /* Initialize the wifi.  */
    memset(nx_wifi_socket, 0, (NX_WIFI_SOCKET_COUNTER * sizeof(NX_WIFI_SOCKET)));
    
    /* Initialize the socket id.  */
    nx_wifi_socket_counter = 0;
    
    /* Create the wifi thread.  */
    status = tx_thread_create(&nx_wifi_thread, "Wifi Thread", nx_wifi_thread_entry, 0,  
                              nx_wifi_thread_stack, NX_WIFI_STACK_SIZE, 
                              NX_WIFI_THREAD_PRIORITY, NX_WIFI_THREAD_PRIORITY, TX_NO_TIME_SLICE, TX_AUTO_START); 
     
    /* Check for thread create errors.  */
    if (status)
        return(status);
    
    return(NX_SUCCESS);
}
 
/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_thread_entry                                PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function is the entry point for NetX Wifi helper thread.  The  */
/*    Wifi helper thread is responsible for receiving packet.             */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    thread_input                          Pointer to IP control block   */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
void nx_wifi_thread_entry(ULONG thread_input)
{
  
/* ESP8266: Move to data receive callback */
//TX_INTERRUPT_SAVE_AREA

/* ESP8266: type */
UINT            i;
UINT            socket_counter;
uint16_t        size;
ESP_WIFI_Status_t   status; 
/* ESP8266: Move to data receive callback */
//NX_PACKET       *packet_ptr;
//NX_TCP_SOCKET   *tcp_socket;
//NX_UDP_SOCKET   *udp_socket;

    while(1)
    {
      
        /* Obtain the IP internal mutex before processing the IP event.  */
        tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);
        
        socket_counter = 0;
        
        /* Check if have socket.  */
        if (nx_wifi_socket_counter != 0)
        {
          
            /* Loop to receive the data from */
            for (i = 0; (i < NX_WIFI_SOCKET_COUNTER) && (socket_counter < nx_wifi_socket_counter); i++)
            {
              
                /* Check if the socket is valid and connected.  */
                if ((nx_wifi_socket[i].nx_wifi_socket_valid == 0) || (nx_wifi_socket[i].nx_wifi_socket_connected == 0))
                    continue;                                           
                
                /* Update the socket counter.  */
                socket_counter++;
                
                /* Loop to receive the data from wifi for current socket.  */
                status = ESP_WIFI_STATUS_OK;
                do
                {

                    /* ESP8266: Make sure there is enough space to store the data before receiving data from WIFI.  */
                    if ((nx_wifi_pool -> nx_packet_pool_available * nx_wifi_pool -> nx_packet_pool_payload_size) < 
                        (ESP_CFG_IPDBUF_SIZE + (NX_WIFI_PACKET_RESERVED * nx_wifi_pool -> nx_packet_pool_payload_size)))
                        break;

                    /* ESP8266: Receive the data in WIFI_READ_TIMEOUT ms.  */
                    if (ESP_WIFI_IsProactRecv(i)) {
                        /* ESP8266: To avoid OOM, we don't proactive receive +CIPRECVDATA data in the background.
                         *          Still, we pass null buffer to go "+IPD" to get notified of incoming data. */
                        status = ESP_WIFI_Recv2(i, NULL, 0, NULL, WIFI_READ_TIMEOUT);
                    } else {
                        /* ESP8266: Reactive receive +IPD data */
                        status = ESP_WIFI_Recv2(i, NULL, 0, NULL, WIFI_READ_TIMEOUT);
                    }

                    /* ESP8266: Notify socket receive */
                    nx_notify_socket_receive(i);

