OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
                    /* ESP8266: Check status.  */
                    if ((status != ESP_WIFI_STATUS_OK) || (size == 0))
                        break;

                    /* ESP8266: Queue the packet.  */
                }while (status == ESP_WIFI_STATUS_OK);  
            }
        }
        
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        
        /* Sleep some ticks to next loop.  */
        tx_thread_sleep(WIFI_THREAD_PERIOD);
    }
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_tick_convert_ms                             PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function converts the ticks to milliseconds.                   */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    tick                                  Tick value                    */
/*    millisecond                           Destination to millisecond    */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
static VOID  nx_wifi_tick_convert_ms(ULONG tick, ULONG *millisecond)
{
  
UINT    factor = 1000/NX_IP_PERIODIC_RATE;
    

    /* Check the wait_option.  */
    if (tick)
    {
      
        /* Change ticks to milliseconds to ticks.  */
        if (tick >= NX_WAIT_FOREVER/factor)
            *millisecond = NX_WAIT_FOREVER;
        else
            *millisecond = (tick * factor);
    }
    else
    {
        *millisecond = 0;
    }    
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_socket_entry_find                           PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function finds an available entry.                             */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    entry_index                           Destination to entry          */
/*    entry_find                            Find flag                     */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
static UINT  nx_wifi_socket_entry_find(void *socket_ptr, UCHAR *entry_index, UCHAR entry_find)
{
    
UINT    i;
UCHAR   empty_index = NX_WIFI_SOCKET_COUNTER;

