OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
    /* Loop to find an empty entry.  */
    for (i = 0; i < NX_WIFI_SOCKET_COUNTER; i++)
    {
        
        /* Check the valid flag.  */
        if (nx_wifi_socket[i].nx_wifi_socket_valid)
        {
          
            /* Check if the entry already exist.  */          
            if (nx_wifi_socket[i].nx_wifi_socket_ptr == socket_ptr)
            {
              
                /* Check if find the entry.  */
                if (entry_find)
                {                
                    *entry_index = i;
                    return(NX_SUCCESS);
                }
                else
                {
                    return(NX_NOT_SUCCESSFUL);
                }
            }
        }
        else
        {
            
            /* Set the empty index.  */
            if (empty_index > i)
                empty_index = i;
        }
    }
    
    /* Check if have empty entry.  */
    if (empty_index >= NX_WIFI_SOCKET_COUNTER)
        return (NX_NOT_SUCCESSFUL);
     
    (*entry_index) = empty_index;
    return(NX_SUCCESS);
}



/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_socket_reset                                PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function resets the entry and release the packet.              */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    entry_index                           Destination to entry          */
/*    entry_find                            Find flag                     */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
static void  nx_wifi_socket_reset(UCHAR entry_index)
{
     
NX_PACKET *next_packet;
NX_PACKET *current_packet;   

    /* Check if this is an valid entry.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_valid == 0)
        return;    

    /* Setup next packet to queue head.  */
    next_packet = nx_wifi_socket[entry_index].nx_wifi_received_packet_head;

    /* Release any packets queued up.  */
    while (next_packet)
    {

        /* Setup the current packet pointer.  */
        current_packet =  next_packet;

        /* Move to the next packet.  */
        next_packet =  next_packet -> nx_packet_queue_next;

        /* Release the current packet.  */
        nx_packet_release(current_packet);
    }
    
    /* Reset the entry.  */
    memset(&nx_wifi_socket[entry_index], 0, sizeof(NX_WIFI_SOCKET));    
    nx_wifi_socket_counter--;
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_socket_receive                              PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function receives packet for wifi socket                       */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    packet_ptr                            Pointer to received packet    */
/*    wait_option                           Suspension option             */
/*    socket_type                           Socket type                   */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
static UINT  nx_wifi_socket_receive(VOID *socket_ptr, NX_PACKET **packet_ptr, ULONG wait_option, UINT socket_type)
{

TX_INTERRUPT_SAVE_AREA
/* ESP8266: Type */
ESP_WIFI_Status_t   status;
UCHAR   entry_index;
ULONG   total_millisecond;
ULONG   wait_millisecond;
UINT    start_time;
ULONG   millisecond;
uint16_t            size;
UINT    received_packet = NX_FALSE;

    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);     
    
    /* Find an avaiable entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

