OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
    /* Check if the socket is connected.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    } 
    
    /* Convert the tick to millisecond.  */
    nx_wifi_tick_convert_ms(wait_option, &total_millisecond); 

    /* ESP8266: No data for reactive receive link */
    if (!nx_wifi_socket[entry_index].nx_wifi_received_packet_head &&
        !ESP_WIFI_IsProactRecv(entry_index)) {
        /* Reactive receive +IPD data through installed receive callback.
         * Ignore return code. */
        wait_millisecond = total_millisecond;
        ESP_WIFI_Recv2(entry_index, NULL, 0, NULL, wait_millisecond);
    }

    /* Disable interrupts.  */
    TX_DISABLE
          
    /* Receive the packet from queue.  */
    if (nx_wifi_socket[entry_index].nx_wifi_received_packet_head)
    {
                
        /* Remove the first packet and process it!  */
          
        /* Pickup the first packet.  */
        *packet_ptr =  nx_wifi_socket[entry_index].nx_wifi_received_packet_head;

        /* Move the head pointer to the next packet.  */
        nx_wifi_socket[entry_index].nx_wifi_received_packet_head =  (*packet_ptr) -> nx_packet_queue_next;

        /* Check for end of deferred processing queue.  */
        if (nx_wifi_socket[entry_index].nx_wifi_received_packet_head == NX_NULL)
        {

            /* Yes, the queue is empty.  Set the tail pointer to NULL.  */
            nx_wifi_socket[entry_index].nx_wifi_received_packet_tail =  NX_NULL;
        }

        /* Restore interrupts.  */
        TX_RESTORE      
        
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_SUCCESS);
    }
    else
    {
        
        /* Restore interrupts.  */
        TX_RESTORE            
        
        /* Get the start time.  */
        start_time = tx_time_get();
        
        /* Loop to receive a packet.  */
        while(total_millisecond)
        {
            
            /* ESP8266: No limit on timeout value */
            wait_millisecond = total_millisecond;

            /* ESP8266: Receive the data within a specified time.  */ 
            /* ESP8266: Proactive receive +CIPRECVDATA data */
            if (ESP_WIFI_IsProactRecv(entry_index)) {
                /* Implement proactive receive for +CIPRECVDATA data */
                status = ESP_WIFI_Recv2(entry_index, (uint8_t*)nx_wifi_buffer, 
                                       sizeof(nx_wifi_buffer), &size, wait_millisecond);
            }

            /* ESP8266: Check status.  */
            if ((status != ESP_WIFI_STATUS_OK) || (size == 0))
            {
                /* ESP8266: Propagate link close error code */
                if (status == ESP_WIFI_STATUS_LINKCLOSED) {
                    break;
                }

                /* Convert the tick to millisecond.  */
                nx_wifi_tick_convert_ms((tx_time_get() - start_time), &millisecond); 
                
                /* Update the remaining millisecond.  */
                if (millisecond >= total_millisecond)
                    total_millisecond = 0;
                else
                    total_millisecond -=millisecond;
                
                continue;
            }
            else
            {
                received_packet = NX_TRUE;
                break;
            }
        }    
        
        /* Check if receive a packet.  */
        if (received_packet != NX_TRUE)
        {
            
            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            /* ESP8266: Propagate link close error code */
            return (status == ESP_WIFI_STATUS_LINKCLOSED) ? (NX_NOT_CONNECTED) : (NX_NO_PACKET);
        }
        
        /* Allocate one packet to store the data.  */
        if (nx_packet_allocate(nx_wifi_pool, packet_ptr,  NX_RECEIVE_PACKET, NX_NO_WAIT))
        {
            /* ESP8266 */
            ESP_LOG_CRIT("Data lost due to failed nx_packet_allocate(...)\r\n");
            
            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }
                      
        /* Set the data.  */
        if (nx_packet_data_append(*packet_ptr, nx_wifi_buffer, size, nx_wifi_pool, NX_NO_WAIT))
        {          
            /* ESP8266 */
            ESP_LOG_CRIT("Data lost due to failed nx_packet_data_append(...)\r\n");

            /* Release the packet.  */
            nx_packet_release(*packet_ptr);
            
            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }
        
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_SUCCESS);
    }
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_tcp_client_socket_connect                   PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function sends wifi connection command                         */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Socket pointer                */
/*    packet_ptr                            Pointer to received packet    */
/*    wait_option                           Suspension option             */
/*    socket_type                           Socket type                   */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_tcp_client_socket_connect(NX_TCP_SOCKET *socket_ptr,
                                        NXD_ADDRESS *server_ip,
                                        UINT server_port,
                                        ULONG wait_option)
{

/* ESP8266: Type */
ESP_WIFI_Status_t    status ;
UCHAR   entry_index;
  
    
    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);
    
    /* Find an avaiable entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 0))
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
    
