OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
    /* Set the entry info.  */
    nx_wifi_socket[entry_index].nx_wifi_socket_ptr = (void *)socket_ptr;
    nx_wifi_socket[entry_index].nx_wifi_socket_valid = 1;
    nx_wifi_socket[entry_index].nx_wifi_socket_type = NX_WIFI_TCP_SOCKET; 
    nx_wifi_socket[entry_index].nx_wifi_socket_connected = 0;
    /* ESP8266: Reset socket receive notify count */
    nx_wifi_socket[entry_index].nx_wifi_socket_receive_notify = 0;
    nx_wifi_socket_counter++;
    
    /* Swap the address.  */
    NX_CHANGE_ULONG_ENDIAN(server_ip -> nxd_ip_address.v4);
  
    /* ESP8266: Wifi connect.  */
    {
        ULONG   wait_millisecond;

        nx_wifi_tick_convert_ms(wait_option, &wait_millisecond); 
        ESP_LOG_WARN("Ignore TCP link local port(%d)\r\n", socket_ptr->nx_tcp_socket_port);
        status = ESP_WIFI_OpenClientConnection2(entry_index, ESP_WIFI_TCP, (uint8_t *) &server_ip -> nxd_ip_address.v4, server_port, 0, wait_millisecond);
    }

    /* Swap the address.  */
    NX_CHANGE_ULONG_ENDIAN(server_ip -> nxd_ip_address.v4);
    
    /* ESP8266 */
    if(status == ESP_WIFI_STATUS_OK)
    {     
            
        /* Update the connect flag.  */
        nx_wifi_socket[entry_index].nx_wifi_socket_connected = 1;   
        
        /* Update the address.  */
        socket_ptr -> nx_tcp_socket_connect_ip.nxd_ip_version = NX_IP_VERSION_V4;
        socket_ptr -> nx_tcp_socket_connect_ip.nxd_ip_address.v4 = server_ip -> nxd_ip_address.v4;
        socket_ptr -> nx_tcp_socket_state =  NX_TCP_ESTABLISHED;  
        
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_SUCCESS); 
    }
    else
    {
      
        /* Reset the entry.  */
        nx_wifi_socket_reset(entry_index);
        
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_tcp_socket_disconnect                       PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function sends wifi disconnect command                         */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Pointer to TCP client socket  */
/*    wait_option                           Suspension option             */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_tcp_socket_disconnect(NX_TCP_SOCKET *socket_ptr, ULONG wait_option)
{
  
UCHAR   entry_index;


    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);
    
    /* Check if the entry already exist.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
    
    /* Check if the socket is connected.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
    
    /* ESP8266: Close connection.  */
    {
        ULONG   wait_millisecond;

        nx_wifi_tick_convert_ms(wait_option, &wait_millisecond); 
        ESP_WIFI_CloseClientConnection2(entry_index, wait_millisecond);
    }

    /* Reset the entry.  */   
    socket_ptr -> nx_tcp_socket_state = NX_TCP_CLOSED;  
      
    /* Reset the entry.  */
    nx_wifi_socket_reset(entry_index);
        
    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
    
    /* Return success.  */
    return(NX_SUCCESS);
}


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_tcp_socket_send                             PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function sends a TCP packet.                                   */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Pointer to socket             */
/*    packet_ptr                            Pointer to packet to send     */
/*    wait_option                           Suspension option             */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_tcp_socket_send(NX_TCP_SOCKET *socket_ptr, NX_PACKET *packet_ptr, ULONG wait_option)
{

/* ESP8266: Type */
ESP_WIFI_Status_t   status ;
UCHAR       entry_index;
uint16_t      send_data_length;
ULONG       packet_size;
NX_PACKET   *current_packet;

    
    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);
        
    /* Find an avaiable entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
    
