OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
    /* Check if already open the connection.  */
    if (nx_wifi_udp_client_socket_connect(socket_ptr, entry_index, NULL, 0))
    {
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }
        
    /* Initialize the current packet to the input packet pointer.  */
    current_packet =  packet_ptr;
    
    /* Loop to send the packet.  */
    while(current_packet)
    {
      
        /* Calculate current packet size. */
        packet_size = (ULONG)(current_packet -> nx_packet_append_ptr - current_packet -> nx_packet_prepend_ptr);

        /* Swap the address.  */
        NX_CHANGE_ULONG_ENDIAN(ip_address -> nxd_ip_address.v4);

        /* ESP8266: Loop to send data.  */ 
        status = ESP_WIFI_SendTo2(entry_index, (uint8_t *)current_packet-> nx_packet_prepend_ptr, 
                               packet_size, &send_data_length, 
                               (uint8_t *) &ip_address -> nxd_ip_address.v4, port,
                               WIFI_WRITE_TIMEOUT);

        /* Swap the address.  */
        NX_CHANGE_ULONG_ENDIAN(ip_address -> nxd_ip_address.v4);

        /* ESP8266: Check status.  */
        if ((status != ESP_WIFI_STATUS_OK) || (send_data_length != packet_size))
        {
          
            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }

#ifndef NX_DISABLE_PACKET_CHAIN
        /* We have crossed the packet boundary.  Move to the next packet
           structure.  */
        current_packet =  current_packet -> nx_packet_next;
#else

        /* End the loop.  */
        current_packet = NX_NULL;
#endif /* NX_DISABLE_PACKET_CHAIN */
    }
        
    /* Release the packet.  */
    nx_packet_release(packet_ptr);
    
    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
    return(NX_SUCCESS);
} 


/**************************************************************************/ 
/*                                                                        */ 
/*  FUNCTION                                               RELEASE        */ 
/*                                                                        */ 
/*    nx_wifi_udp_socket_receive                          PORTABLE C      */
/*                                                           6.0          */
/*  AUTHOR                                                                */
/*                                                                        */
/*    Yuxin Zhou, Microsoft Corporation                                   */
/*                                                                        */
/*  DESCRIPTION                                                           */ 
/*                                                                        */
/*    This function receives UDP packet.                                  */
/*                                                                        */ 
/*  INPUT                                                                 */ 
/*                                                                        */
/*    socket_ptr                            Pointer to UDP socket         */
/*                                                                        */ 
/*  OUTPUT                                                                */ 
/*                                                                        */ 
/*    status                                Completion status             */
/*                                                                        */ 
/*  CALLS                                                                 */ 
/*                                                                        */ 
/*    None                                                                */ 
/*                                                                        */ 
/*  CALLED BY                                                             */ 
/*                                                                        */ 
/*    Application Code                                                    */ 
/*                                                                        */ 
/*  RELEASE HISTORY                                                       */ 
/*                                                                        */ 
/*    DATE              NAME                      DESCRIPTION             */
/*                                                                        */
/*  05-19-2020     Yuxin Zhou               Initial Version 6.0           */
/*                                                                        */
/**************************************************************************/
UINT  nx_wifi_udp_socket_receive(NX_UDP_SOCKET *socket_ptr, NX_PACKET **packet_ptr, ULONG wait_option)
{
UCHAR       entry_index;

    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);
    
    /* Find an avaiable entry.  */
    if (nx_wifi_socket_entry_find((void *)socket_ptr, &entry_index, 1))
    {
      
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* ESP8266: Do link connection before bind/send/receive */

    /* Check if already open the connection.  */
    if (nx_wifi_udp_client_socket_connect(socket_ptr, entry_index, NULL, 0))
    {
        /* Release the IP internal mutex before processing the IP event.  */
        tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
        return(NX_NOT_SUCCESSFUL);
    }

    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
     
    return(nx_wifi_socket_receive((VOID*)socket_ptr, packet_ptr, wait_option, NX_WIFI_UDP_SOCKET));
} 

/* ESP8266: Data receive callback */
static void nxesp_datarecv_handler(void *Ctx, uint8_t LinkID, uint8_t *Data, uint16_t Size)
{
    TX_INTERRUPT_SAVE_AREA
    NX_PACKET *packet_ptr = NULL;
    UCHAR entry_index = LinkID;
    NXESP_DATARECV_CTX *datarecv_ctx = (NXESP_DATARECV_CTX *) Ctx;

    ESP_ASSERT(datarecv_ctx);
    ESP_ASSERT(datarecv_ctx == &nxesp_datarecv_ctx);

    /* Remaining +IPD data for reactive receive */
    if (LinkID >= NX_WIFI_SOCKET_COUNTER) {
        ESP_LOG_CRIT("Parameter error in data receive callback: LinkID(%d)\r\n", LinkID);
        return;
    }

    ESP_ASSERT(nx_wifi_pool);

