OpenNuvoton/azure-getting-started/Nuvoton/M480/lib/netx_esp8266_driver/nx_wifi.c
    /* ESP8266: Null Data/Size, inform that proactive receive link +CIPRECVDATA data is expected */
    if (!Data || !Size) {
        /* Defer socket receive notify to outside; Otherwise, recursive into ESP8266 driver. */
        nx_wifi_socket[entry_index].nx_wifi_socket_receive_notify ++;
        return;
    }

    /* Allocate one packet to store the data.  */
    if (nx_packet_allocate(nx_wifi_pool, &packet_ptr,  NX_RECEIVE_PACKET, NX_NO_WAIT)) {
        ESP_LOG_WARN("Receive data lost due to failed nx_packet_allocate(...)\r\n");
        return;
    }
    ESP_ASSERT(packet_ptr);
       
    /* Set the data.  */
    if (nx_packet_data_append(packet_ptr, Data, Size, nx_wifi_pool, NX_NO_WAIT)) {
        ESP_LOG_WARN("Receive data lost due to failed nx_packet_data_append(...)\r\n");
        nx_packet_release(packet_ptr);
        return;
    }

    /* Disable interrupts.  */
    TX_DISABLE
          
    /* Check to see if the deferred processing queue is empty.  */
    if (nx_wifi_socket[entry_index].nx_wifi_received_packet_head)
    {

        /* Not empty, just place the packet at the end of the queue.  */
        (nx_wifi_socket[entry_index].nx_wifi_received_packet_tail) -> nx_packet_queue_next =  packet_ptr;
        packet_ptr -> nx_packet_queue_next =  NX_NULL;
        nx_wifi_socket[entry_index].nx_wifi_received_packet_tail =  packet_ptr;

        /* Restore interrupts.  */
        TX_RESTORE
    }
    else
    {

        /* Empty deferred receive processing queue.  Just setup the head pointers and
           set the event flags to ensure the IP helper thread looks at the deferred processing
           queue.  */
        nx_wifi_socket[entry_index].nx_wifi_received_packet_head =  packet_ptr;
        nx_wifi_socket[entry_index].nx_wifi_received_packet_tail =  packet_ptr;
        packet_ptr -> nx_packet_queue_next =             NX_NULL;

        /* Restore interrupts.  */
        TX_RESTORE

        /* Defer socket receive notify to outside; Otherwise, recursive into ESP8266 driver. */
        nx_wifi_socket[entry_index].nx_wifi_socket_receive_notify ++;
    }
}

/* ESP8266: Notify socket receive */
static void nx_notify_socket_receive(uint8_t entry_index)
{
    NX_TCP_SOCKET   *tcp_socket;
    NX_UDP_SOCKET   *udp_socket;

    if (nx_wifi_socket[entry_index].nx_wifi_socket_receive_notify) {
        nx_wifi_socket[entry_index].nx_wifi_socket_receive_notify = 0;
    } else {
        return;
    }

    /* Check the socket type.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_type == NX_WIFI_TCP_SOCKET)
    {
                            
        /* Get the tcp socket.  */
        tcp_socket = (NX_TCP_SOCKET *)nx_wifi_socket[entry_index].nx_wifi_socket_ptr;
        
        /* Determine if there is a socket receive notification function specified.  */
        if (tcp_socket -> nx_tcp_receive_callback)
        {

            /* Yes, notification is requested.  Call the application's receive notification
               function for this socket.  */
               (tcp_socket -> nx_tcp_receive_callback)(tcp_socket);
        }
    }
    else
    {
                          
        /* Get the udp socket.  */
        udp_socket = (NX_UDP_SOCKET *)nx_wifi_socket[entry_index].nx_wifi_socket_ptr;
                            
        /* Determine if there is a socket receive notification function specified.  */
        if (udp_socket -> nx_udp_receive_callback)
        {

            /* Yes, notification is requested.  Call the application's receive notification
               function for this socket.  */
            (udp_socket -> nx_udp_receive_callback)(udp_socket);
        }                     
    }
}

/* ESP8266: UDP client connect */
static UINT nx_wifi_udp_client_socket_connect(NX_UDP_SOCKET *socket_ptr,
                                              UCHAR entry_index,
                                              NXD_ADDRESS *server_ip,
                                              UINT server_port)
{
    ESP_WIFI_Status_t   status ;

    /* Obtain the IP internal mutex before processing the IP event.  */
    tx_mutex_get(&(nx_wifi_ip -> nx_ip_protection), TX_WAIT_FOREVER);

    /* Check if already open the connection.  */
    if (nx_wifi_socket[entry_index].nx_wifi_socket_connected == 0)
    {
        
        if (server_ip) {
            /* Swap the address.  */
            NX_CHANGE_ULONG_ENDIAN(server_ip -> nxd_ip_address.v4);

            /* ESP8266: Open connection, remote changeable */
            status = ESP_WIFI_OpenClientConnection(entry_index, ESP_WIFI_UDP, (uint8_t *) &server_ip -> nxd_ip_address.v4, server_port, (2 << 16) | socket_ptr -> nx_udp_socket_port);

            /* Swap the address.  */
            NX_CHANGE_ULONG_ENDIAN(server_ip -> nxd_ip_address.v4);
        }
        else {
            ULONG dummy_ip_address = 0;
            USHORT dummy_port = 0;

            /* Swap the address.  */
            NX_CHANGE_ULONG_ENDIAN(dummy_ip_address);

            /* ESP8266: Open connection, remote changeable */
            status = ESP_WIFI_OpenClientConnection(entry_index, ESP_WIFI_UDP, (uint8_t *) &dummy_ip_address, dummy_port, (2 << 16) | socket_ptr -> nx_udp_socket_port);

            /* Swap the address.  */
            NX_CHANGE_ULONG_ENDIAN(dummy_ip_address);
        }

        /* Check status.  */
        if(status)
        {
            /* Reset the entry.  */
            nx_wifi_socket_reset(entry_index);

            /* Release the IP internal mutex before processing the IP event.  */
            tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
            return(NX_NOT_SUCCESSFUL);
        }

        /* Update the connect flag.  */
        nx_wifi_socket[entry_index].nx_wifi_socket_connected = 1;   
    }

    /* Release the IP internal mutex before processing the IP event.  */
    tx_mutex_put(&(nx_wifi_ip -> nx_ip_protection));
    return(NX_SUCCESS);
}
